Documents/ВводНачальногоСальдоПоЗаработнойПлате.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ВводНачальногоСальдоПоЗаработнойПлате</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>CalculationRegister.Сальдо</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьПоБУ</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Расчеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачальноеСальдоДебет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачальноеСальдоКредит</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CalculationRegisters/Сальдо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<CalculationRegister>
		<Properties>
			<Name>Сальдо</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>false</ActionPeriod>
			<BasePeriod>false</BasePeriod>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.Сальдо</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

Documents/ВводНачальногоСальдоПоЗаработнойПлате/Ext/ObjectModule.bsl
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ДобавитьПрефиксУзла(Префикс);
	
КонецПроцедуры

Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("","");
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	
	Если не ЕстьПолныеПрава() Тогда
	Если РасчетныйПериод<>Константы.ТекущийРасчетныйПериод.Получить() Тогда
		Отказ=истина;
		Предупреждение("Для проведения документа смените расчетный период на "+Формат(РасчетныйПериод,"ДФ=MMMM.yyyy"));
	КонецЕсли; 
	Конецесли;
	
	Заголовок = ПредставлениеДокументаПриПроведении(Ссылка);
	
	СтруктураШапкиДокумента = СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	//ДвиженияПоБУ(Режим, Отказ, Заголовок,СтруктураШапкиДокумента);
		
	ДвиженияПоРегистрам(Режим, Отказ, Заголовок,СтруктураШапкиДокумента);
	
КонецПроцедуры

Процедура ДвиженияПоРегистрам(Режим, Отказ, Заголовок,СтруктураШапкиДокумента)
	
	Для каждого СтрокаРасчеты из Расчеты Цикл
		
		Если СтрокаРасчеты.НачальноеСальдоДебет<>0 Тогда
			Движение=Движения.Сальдо.Добавить();
			Движение.ПериодРегистрации=НачалоМесяца(Дата);
			Движение.Организация=Организация;
			Движение.Сотрудник=СтрокаРасчеты.Сотрудник;
			Движение.ВидРасчета=ПланыВидовРасчета.Сальдо.НачальноеСальдоДебет;
			Движение.Результат=СтрокаРасчеты.НачальноеСальдоДебет;
		КонецЕсли; 
	
		Если СтрокаРасчеты.НачальноеСальдоКредит<>0 Тогда
			Движение=Движения.Сальдо.Добавить();
			Движение.ПериодРегистрации=НачалоМесяца(Дата);
			Движение.Организация=Организация;
			Движение.Сотрудник=СтрокаРасчеты.Сотрудник;
			Движение.ВидРасчета=ПланыВидовРасчета.Сальдо.НачальноеСальдоКредит;
			Движение.Результат=СтрокаРасчеты.НачальноеСальдоКредит;
		КонецЕсли; 
		
		Если СтрокаРасчеты.НачальноеСальдоДебет<>0 Тогда
			Проводка=Движения.Хозрасчетный.Добавить();
			Проводка.Период      = Дата;
			Проводка.Организация = Организация;
			Проводка.Содержание = "";     
			
			Проводка.СчетДт     =  ПланыСчетов.Хозрасчетный.НайтиПоКоду("6710");
			УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,1,СтрокаРасчеты.Сотрудник);
			
			Проводка.СчетКт      = ПланыСчетов.Хозрасчетный.НайтиПоКоду("000");
			
			Проводка.Сумма = СтрокаРасчеты.НачальноеСальдоДебет; 

		КонецЕсли; 
	
		Если СтрокаРасчеты.НачальноеСальдоКредит<>0 Тогда
			Проводка=Движения.Хозрасчетный.Добавить();
			Проводка.Период      = Дата;
			Проводка.Организация = Организация;
			Проводка.Содержание = "";     
			
			Проводка.СчетДт     =  ПланыСчетов.Хозрасчетный.НайтиПоКоду("000");
			
			Проводка.СчетКт      = ПланыСчетов.Хозрасчетный.НайтиПоКоду("6710");
			УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,1,СтрокаРасчеты.Сотрудник);
			
			Проводка.Сумма = СтрокаРасчеты.НачальноеСальдоКредит; 
		КонецЕсли; 
		
	КонецЦикла; 
	
	Движения.Сальдо.Записать();
	
КонецПроцедуры

Функция ПечатьДокумента(ИмяМакета)
	ТабДок = Новый ТабличныйДокумент;
	
	//Макет = ПолучитьОбщийМакет(ИмяМакета);
	
	//Руководители = ОтветственныеЛица(Организация, Дата);	
	//Область.Параметры.Заполнить(Руководители);
	//Область = Макет.ПолучитьОбласть("ПП");
	//Область.Параметры.Номер = ПолучитьНомерНаПечать(ЭтотОбъект);
	
	//ТабДок.Вывести(Область);
	//ТабДок.ФиксацияСверху=0;
	//ТабДок.ФиксацияСлева=0;
	//ТабДок.ЭкземпляровНаСтранице=0;
	//ТабДок.ТолькоПросмотр = Истина;
	
	Возврат ТабДок;
КонецФункции

Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать
	
	ТабДокумент = ПечатьДокумента(ИмяМакета);
		
	НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, "");
	
КонецПроцедуры // Печать()

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если не ЕстьПолныеПрава() Тогда
	Если РасчетныйПериод<>Константы.ТекущийРасчетныйПериод.Получить() Тогда
		Отказ=истина;
		Предупреждение("Для отмены проведения документа смените расчетный период на "+Формат(РасчетныйПериод,"ДФ=MMMM.yyyy"));
	КонецЕсли; 
	Конецесли;
	
КонецПроцедуры
